mg-emacs.org
:PROPERTIES:
:ID:       d3909734-3c20-430c-b0c1-7246984a0111
:END:
#+TITLE: Emacs configuration
#+AUTHOR: Claudio Migliorelli <claudio.migliorelli@mail.polimi.it>
#+macro: latest-export-date (eval (format-time-string "%Y-%m-%d, %A @ %I:%M %p"))
#+macro: word-count (eval (count-words (point-min) (point-max)))
#+macro: lines-count (eval (count-lines (point-min) (point-max)))
#+macro: file-creation-date (eval (file-attributes (f-this-file)))
#+options: toc:nil
*This file was revised and exported on {{{latest-export-date}}}, with a word count of {{{word-count}}} and a line count of {{{lines-count}}}.*

This is a literate GNU Emacs configuration file. It doesn't serve as an actual configuration file, but as a commentary on the configuration itself and generates all the source files used to modify and tweak the Emacs text editor. This file is therefore verbose, with prose describing each and every piece of code listed in it. This serves as a future reference for me to have a clue on why some design choices have been preferred with respect to others.
As of {{{latest-export-date}}}, the structure of this directory is organized as follows:
#+begin_src bash :wrap example :exports results
  tree -aF -L 2 -I 'straight|edts|elpa|.git|eln-cache|.headers|.gitignore|.gitmodules|.snippets|.locks|auto-save-list|url'
#+end_src

#+RESULTS:
#+begin_example
| ./  |                    |                                |       |
| ├── | init.el            |                                |       |
| ├── | LICENSE.md         |                                |       |
| ├── | mg-custom-modules/ |                                |       |
| │   | ├──                | mg-bib.el                      |       |
| │   | ├──                | mg-citar-denote.el             |       |
| │   | ├──                | mg-defaults-extensions.el      |       |
| │   | ├──                | mg-denote.el                   |       |
| │   | ├──                | mg-emacs.el                    |       |
| │   | ├──                | mg-kernel.el                   |       |
| │   | ├──                | mg-macos.el                    |       |
| │   | ├──                | mg-modeline.el                 |       |
| │   | ├──                | mg-notmuch.el                  |       |
| │   | ├──                | mg-org.el                      |       |
| │   | ├──                | mg-org-gtd.el                  |       |
| │   | ├──                | mg-personal.el                 |       |
| │   | ├──                | mg-pkm-utils.el                |       |
| │   | └──                | mg-utils.el                    |       |
| ├── | mg-emacs-modules/  |                                |       |
| │   | ├──                | mg-emacs-ai.el                 |       |
| │   | ├──                | mg-emacs-bib.el                |       |
| │   | ├──                | mg-emacs-browsing.el           |       |
| │   | ├──                | mg-emacs-buffers-completion.el |       |
| │   | ├──                | mg-emacs-buffers.el            |       |
| │   | ├──                | mg-emacs-defaults.el           |       |
| │   | ├──                | mg-emacs-denote.el             |       |
| │   | ├──                | mg-emacs-files.el              |       |
| │   | ├──                | mg-emacs-flashcards.el         |       |
| │   | ├──                | mg-emacs-git.el                |       |
| │   | ├──                | mg-emacs-languages.el          |       |
| │   | ├──                | mg-emacs-layouts.el            |       |
| │   | ├──                | mg-emacs-ledger.el             |       |
| │   | ├──                | mg-emacs-markup.el             |       |
| │   | ├──                | mg-emacs-notmuch.el            |       |
| │   | ├──                | mg-emacs-org.el                |       |
| │   | ├──                | mg-emacs-package-managers.el   |       |
| │   | ├──                | mg-emacs-programming.el        |       |
| │   | └──                | mg-emacs-themes.el             |       |
| └── | mg-emacs.org       |                                |       |
|     |                    |                                |       |
| 3   | directories,       | 36                             | files |
#+end_example

In general, this configuration is organized using modules, each designed to introduce a set of packages for a specific purpose. The objective is to minimize the number of packages introduced within a single module to ensure a clear separation of concerns. Introducing too many packages at once reduces clarity.

I started using GNU Emacs at ~ [2020-04-30 Thu], and I've been tweaking and extensively using it since then. This will become quite evident when you go through this configuration file. Since I even used it as a window manager for X (until I switched to Wayland), it's not an exaggeration to say that I've been heavily working with Emacs in the last ~ 5 years. Each section of this document serves as introduction to a single module, and subsections focus on different core packages/configurations inside that module. Hope this becomes pretty self-explanatory throughout this artifact.

Therefore, the structure of this configuration file can be summarized as follows:
- The ~init.el~ source file :: This is the main point of entry for the entire configuration, and it is the source file read when Emacs is starting up. This file then loads the Emacs modules, which enable packages and functionalities for the editor;
- The ~mg-emacs-modules~ :: These are modules that loads Emacs packages, without introducing any custom functionalities. The only tweaking activity done by those source files is simple package configuration. Those source files may load custom libraries (see next entry);
- The ~mg-custom-modules~ :: These are custom modules written by me. Their goal is to introduce new functionalities, extend packages and tweak the Emacs editor. In other words, while ~mg-emacs-modules~ only "load" the packages and tweak their variables and options, ~mg-custom-modules~ modify and extend the behavior of both Emacs and its loaded packages.


#+toc: headlines 5

* The ~init.el~ source file

This file deals with the early initialization of the GNU Emacs editor. It is, indeed, the main source file that is loaded by Emacs when performing the startup. What it does is to simply load all the other modules. There is a ~require~ statement for each module to load into the editor. There are several conditions to discriminate whether a module should be loaded based on which system Emacs is executing.

#+begin_src emacs-lisp :tangle "init.el"
  (require 'server)
  (unless (server-running-p)
    (server-start))

  (add-to-list 'load-path (expand-file-name
  			 "~/.emacs.d/mg-emacs-modules/"))
  (add-to-list 'load-path (expand-file-name
  			 "~/.emacs.d/mg-custom-modules/"))

  (require 'mg-emacs-package-managers)
  (require 'mg-utils)
  (require 'mg-emacs-defaults)
  (require 'mg-emacs-themes)
  (require 'mg-emacs-buffers-completion)
  (require 'mg-emacs-files)
  (require 'mg-emacs-buffers)
  (when (not (mg-connected-via-ssh-p))
    (progn
      (require 'mg-emacs-layouts)
      (require 'mg-emacs-org)
      (require 'mg-emacs-denote)
      (require 'mg-emacs-bib)
      (require 'mg-emacs-ledger)
      (require 'mg-emacs-flashcards)
      (require 'mg-emacs-notmuch)
      (require 'mg-emacs-browsing)
      (require 'mg-emacs-ai)))
  (require 'mg-emacs-markup)
  (require 'mg-emacs-languages)
  (require 'mg-emacs-git)
  (require 'mg-emacs-programming)
#+end_src

* The ~mg-emacs-modules~
** The ~mg-emacs-package-managers.el~ module

The idea of this module is to initialize the package managers that I use. In my system, ~use-package~ and ~straight.el~ are used in conjunction, and I think that the flexibility they provide is simply amazing. I started using ~straight.el~ from [2024-01-30 Tue] and never regret that decision.

Thus, this module provides the bootstrapping phase for both the two package managers. From Emacs 29, ~use-package~ doesn't need to be installed anymore, it is built into Emacs. The code below just adds ~melpa~ as the list of sources and do ~package-initialize~. Just a required clarification: ~use-package~ is not a package manager, it is just a set of macros. For the sake of clarity, I called this module ~mg-emacs-package-managers.el~, although both ~use-package~ and ~straight.el~ are not strictly "package managers". In general, I don't care, and that's why I'll use this slight abuse of notation from now on.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-package-managers.el" :mkdirp yes
  (require 'package)
  (setq package-enable-at-startup nil)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  (unless package--initialized (package-initialize))
#+end_src

Then, the module handles the bootstrapping phase of ~straight.el~ as well. The code below downloads the bootstrap file for ~straight.el~, in case it hasn't been already downloaded, and executes that file using ~load~. The more I use this editor extensively, the more it happens that I'd like to have features on "develop" branches for some packages, and having a declarative way to pull the package directly from its repository, specifying which branch we're interested in (or even which commit), feels very appealing.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-package-managers.el"

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
  	"straight/repos/straight.el/bootstrap.el"
  	(or (bound-and-true-p straight-base-dir)
  	    user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
  	(url-retrieve-synchronously
  	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
  	 'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (provide 'mg-emacs-package-managers)
#+end_src

