mg-emacs.org
** The ~mg-emacs-defaults.el~ module

This module contains the initialization of some useful defaults that I use within Emacs.

When going through the module, you'll see that there is a condition checking if I'm running on MacOS, and, if that's the case, it loads a custom library, called ~mg-macos.el~ (see [[id:93f60f28-3019-4010-9012-f7897dc3b873][The ~mg-macos~ library]]). In fact, mainly when on laptops for work, I use Emacs also on MacOS and, thus, I needed some code to make the system work flawlessly on that operating system.

The code below is used to disable some boring modes like ~scroll-bar-mode~ and ~tool-bar-mode~, menus and the like, and to enable others that I find particularly useful, such as ~visual-mode~ and ~show-paren-mode~. Moreover, I have the definition of some defaults for locales and encoding.
Historically, this module enclosed a bunch of other customizations for variables related to specific modes (e.g., ~org-mode~, ~c-mode~). I found it confusing and even wrong in some cases. That's why now the idea is to tweak emacs-specific variables *only*.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-defaults.el"
  (use-package emacs
    :bind (("M-n" . forward-paragraph)
  	 ("M-p" . backward-paragraph)
  	 ("C-c u r s" . replace-string)
  	 ("C-c u r q" . query-replace-regexp)
  	 ("C-c u r r" . query-replace)
  	 ("C-c u r c" . comment-region)
  	 ("C-c u r u" . uncomment-region)
  	 ("C-c u r i" . indent-region)
  	 ("C-c u r a r" . align-regexp)
  	 ("C-c u r a e" . align-entire)
  	 ("C-c u c w" . whitespace-mode)
  	 ("C-c u m" . compile)
  	 ("C-c u x" . async-shell-command)
  	 ("C-c u w f" . toggle-frame-fullscreen)
  	 ("C-c u w m" . toggle-frame-maximized)
  	 ("C-x C-n" . next-buffer)
  	 ("C-x a a" . async-shell-command)
  	 ("C-x C-p" . previous-buffer))
    :init
    (global-set-key (kbd "C-x C-n") nil)
    (global-set-key (kbd "C-x C-p") nil)
    (defconst emacs-tmp-dir (expand-file-name (format "emacs%d" (user-uid)) temporary-file-directory))
    (defconst mg-dot-private-file "~/Repositories/knock-files-private")
    (defconst mg-emacs-root "~/.emacs.d")
    (defconst mg-sendmail-bin "/usr/bin/msmtp")
    (setq inhibit-startup-screen t
  	completion-cycle-threshold 3
  	tab-always-indent 'complete
  	create-lockfiles nil
  	user-emacs-directory (expand-file-name "~/.cache/emacs/")
  	bookmarks-file (expand-file-name ".bookmarks/bookmarks" mg-emacs-root)
  	url-history-file (expand-file-name "url/history" user-emacs-directory)
  	custom-file (if (boundp 'server-socket-dir)
  			(expand-file-name "custom.el" server-socket-dir)
  		      (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory))
  	backup-by-copying t
  	delete-old-versions t
  	kept-new-versions 6
  	kept-old-versions 2
  	message-send-mail-function 'message-send-mail-with-sendmail
  	sendmail-program mg-sendmail-bin
  	version-control t
  	auto-save-list-file-prefix emacs-tmp-dir
  	auto-save-file-name-transforms `((".*" ,emacs-tmp-dir t))
  	backup-directory-alist `((".*" . ,emacs-tmp-dir)))
    
    (setq-default frame-title-format '("%b")
  		ring-bell-function 'ignore
  		tab-width 8
  		frame-resize-pixelwise t
  		linum-format "%4d "
  		use-short-answers t
  		electric-indent-mode nil
  		make-backup-files nil
  		global-auto-revert-mode t
  		confirm-kill-processes nil
  		process-connection-type nil
  		org-src-fontify-natively t
  		;; warning-minimum-level :emergency
  		set-language-environment "UTF-8"
  		system-time-locale "C"
  		native-comp-async-report-warnings-errors nil)
    (load custom-file t)
    (add-hook 'window-setup-hook 'toggle-frame-maximized t)
    (add-to-list 'yank-excluded-properties 'face)
    (if (display-graphic-p)
        (dolist (mode
  	       '(tool-bar-mode
  		 scroll-bar-mode
  		 menu-bar-mode
  		 tooltip-mode
  		 blink-cursor-mode))
  	(funcall mode 0)))
    (dolist (mode
  	   '(global-visual-line-mode
  	     show-paren-mode))
      (funcall mode 1)))

  (use-package mg-macos
    :if (eq system-type 'darwin)
    :ensure nil
    :config
    (mg-macos-support-enable))

  (use-package mg-emacs
    :after (mg-utils)
    :bind (("C-c p s" . mg-take-screenshot)
  	 ("C-c u f" . mg-add-current-file-name-to-killring)
  	 ("C-c u t" . mg-insert-today-timestamp-formatted)))

  (use-package mg-defaults-extensions
    :ensure nil
    :config
    (add-hook 'prog-mode-hook
  	    #'mg-line-numbers-highlight-line-mode))
#+end_src

The ~mg-line-numbers-highlight-line-mode~ minor mode is only used when the ~prog-mode~ major mode is enabled. There is no reason for my specific use cases to have line numbers outside of coding. However, I use this feature quite extensively when programming. In text editors like Emacs, relative line numbers add a 10x speed in the way you insert/remove/modify text.

Next, I enable ~which-key~ to remind me what keybinds to use to perform some actions. This is convenient because I often forget some keybindings that are not constantly part of my workflow. The idea of which-key is to pop a small list in the minibuffer showing pairs of ~(<next_key>, <emacs-command>)~ to facilitate the choice of pressing the next key in the sequence of keys for launching a certain Emacs command.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-defaults.el"
  (use-package which-key
    :straight t
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+end_src

Starting from [2024-04-14 Sun], I decided to implement my own mode-line to keep things simple and under control. I thought there was so much wasted space in the default one, and most of the information were not completely clear. Now, I can immediately see whether I'm editing a local or remote file (i.e., by looking at either ~"@"~ or ~"^"~ characters on the left-hand side of the modeline), which derived mode I'm in, and whether the current buffer is in read-only mode. Those are all information already specified by the default modeline, but their arrangement and syntax was unclear to me. The below snippet flows into the ~mg-custom-modeline.el~ module.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-defaults.el"
  (use-package mg-modeline
    :ensure nil)

  (provide 'mg-emacs-defaults)
#+end_src

** The ~mg-emacs-themes.el~ module

I typically favor simple and highly legible themes. I often switch between themes, and the process of finding one that truly suits me is ongoing. However, I generally rely on two different configurations, depending on the system I'm using (e.g., Linux vs. Mac). I prefer dark themes over light ones, and I enable a night shift with warmer colors settings across the entire day. I find that warm light is more comfortable for my eyes. The theme I am most attached to is [[https://github.com/bbatsov/zenburn-emacs][Zenburn]], a color scheme with a very low "distance" between its colours, which I find aesthetically pleasing and comfortable for my eyes.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-themes.el"
  (defun mg-init-macos-theme ()
    "Enable the theme environment of choice for darwin."
    (load-theme 'modus-vivendi t)
    (set-frame-font "DejaVu Sans Mono 18" nil t))

  (defun mg-init-cli-theme ()
    "Enable the theme environment of choice when from CLI."
    (load-theme 'modus-vivendi)
    (custom-set-faces '(mode-line ((t (:background "grey75" :foreground "black"
  						 :box (:line-width -1 :style released-button)))))
  		    '(mode-line-inactive ((t (:background "grey60" :foreground "black"
  							  :box (:line-width -1 :style released-button))))))
    (menu-bar-mode -1))

  (defun mg-init-linux-theme ()
    "Enable the theme enviroment of choice for linux."
    (load-theme 'modus-vivendi t)
    (set-frame-font "DejaVu Sans Mono 14" nil t))

  (if (display-graphic-p)
      (if (equal system-type 'darwin)
    	(mg-init-macos-theme)
        (mg-init-linux-theme))
    (mg-init-cli-theme))
  (set-fringe-mode 0)
#+end_src

The only other feature that needs some clarification for the above code is the conditional statement on the ~display-graphic-p~. When not on the GUI version of Emacs (i.e., from CLI), I prefer not to select any theme and just stick with the one used in the terminal emulator. I find this way to go way less confusing, and surely lowers cognitive overhead for me.
The following piece of code introduces ~hide-mode-line~ mode, which is used in a custom function of mine to enable PDF presentation mode (not technically an Emacs mode, rather a custom layout).

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-themes.el"
  (use-package hide-mode-line
    :straight t)

  (provide 'mg-emacs-themes)
#+end_src

** The ~mg-emacs-layouts.el~ module
:PROPERTIES:
:ID:       3B58B914-77A7-4942-A229-1A639C6B9287
:END:

In this module I enable some other packages I use to visually customize buffers and text within Emacs. For instance, I use ~olivetti~ and ~logos~ in conjunction for conveniently display text to avoid distractions. This comes into play when I need to write huge wall of texts without switching back and forth to code listings (moving from a full-width piece of code to the ~olivetti-logos~ layout is indeed confusing to me, and raises cognitive overload).

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-layouts.el"
  (use-package olivetti
    :straight t)

  (use-package logos
    :bind (("C-c p f" . logos-focus-mode))
    :straight t
    :custom
    (logos-outlines-are-pages t)
    :config
    (setq-default logos-hide-cursor nil
  		logos-hide-mode-line t
  		logos-hide-header-line t
  		logos-hide-buffer-boundaries t
  		logos-hide-fringe t
  		logos-variable-pitch nil
  		logos-buffer-read-only nil
  		logos-scroll-lock nil
  		logos-olivetti t)
    (let ((map global-map))
      (define-key map [remap narrow-to-region] #'logos-narrow-dwim)
      (define-key map [remap forward-page] #'logos-forward-page-dwim)
      (define-key map [remap backward-page] #'logos-backward-page-dwim)))

  (provide 'mg-emacs-layouts)
#+end_src

