mg-emacs.org
** The ~mg-emacs-buffers-completion.el~ module

Buffer management and buffer/minibuffer completion are unified in this configuration. I switch and manage (e.g., kill) buffers mainly through ~consult-ibuffer~ (to be described later), but sometimes I find useful to have a grouping and management that I find similar to ~dired~. That's why I use ~ibuffer~, which provides these features out-of-the-box, and it is part of Emacs since version 22.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-buffers-completion.el"
  (use-package ibuffer
    :ensure nil
    :bind
    (("C-x C-b" . ibuffer))
    :config
    (setq ibuffer-expert t)
    (setq ibuffer-saved-filter-groups
  	(quote (("default"
  		 ("org" (mode . org-mode))
  		 ("dired" (mode . dired-mode))
  		 ("magit" (name . "^magit"))
  		 ("c-src" (mode . c-mode))
  		 ("python-src" (mode . python-mode))
  		 ("virt-manager" (name . "^Virt-manager"))
  		 ("brave" (name . "^Brave"))
  		 ("jabber" (name . "^*-jabber"))
  		 ("vterminal" (name . "^\\*vterminal"))
  		 ("emacs" (or
  			   (name . "^\\*scratch\\*$")
  			   (name . "^\\*Messages\\*$")))
  		 ))))
    (setq ibuffer-default-sorting-mode 'alphabetic)
    (add-hook 'ibuffer-mode-hook
  	    (lambda ()
  	      (ibuffer-switch-to-saved-filter-groups "default")
  	      )))
#+end_src

For completion in both standard buffers and minibuffers, I employ a popular stack of packages: Vertico, Orderless, Marginalia, Consult, and Corfu. I particularly appreciate the modular nature of this setup. For instance, if a user doesn't favor Consult, they can easily retain the default completion system while still benefiting from the other packages. Personally, I find these packages highly effective in their default configurations, so I've rarely felt the need to customize them extensively.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-buffers-completion.el"

  (use-package vertico
    :straight t
    :config
    (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy)
    (vertico-mode))

  (use-package marginalia
    :straight t
    :config
    (marginalia-mode))

  (use-package savehist
    :straight t
    :config
    (savehist-mode))

  (use-package orderless
    :straight t
    :custom
    (completion-styles '(orderless basic)))

  (use-package consult
    :straight t
    :bind (
  	 ("C-c M-x" . consult-mode-command)
  	 ("C-c h" . consult-history)
  	 ("C-c k" . consult-kmacro)
  	 ("C-c M-m" . consult-man)
  	 ("C-c i" . consult-info)
  	 ([remap Info-search] . consult-info)

  	 ("C-x b" . consult-buffer)
  	 ("C-x r b" . consult-bookmark)
  	 ("C-x p b" . consult-project-buffer)

  	 ("M-#" . consult-register-load)
  	 ("M-'" . consult-register-store)
  	 ("C-M-#" . consult-register)

  	 ("M-y" . consult-yank-pop)

  	 ("M-g e" . consult-compile-error)
  	 ("M-g f" . consult-flymake)
  	 ("M-g g" . consult-goto-line)
  	 ("M-g M-g" . consult-goto-line)
  	 ("M-g o" . consult-outline)
  	 ("M-g m" . consult-mark)
  	 ("M-g k" . consult-global-mark)
  	 ("M-g i" . consult-imenu)
  	 ("M-g I" . consult-imenu-multi)

  	 ("M-s d" . consult-find)
  	 ("M-s c" . consult-locate)
  	 ("M-s g" . consult-grep)
  	 ("M-s G" . consult-git-grep)
  	 ("M-s r" . consult-ripgrep)
  	 ("M-s l" . consult-line)
  	 ("M-s L" . consult-line-multi)
  	 ("M-s k" . consult-keep-lines)
  	 ("M-s u" . consult-focus-lines)

  	 ("M-s e" . consult-isearch-history)
  	 :map isearch-mode-map
  	 ("M-e" . consult-isearch-history)
  	 ("M-s e" . consult-isearch-history)
  	 ("M-s l" . consult-line)
  	 ("M-s L" . consult-line-multi)

  	 :map minibuffer-local-map
  	 ("M-s" . consult-history)
  	 ("M-r" . consult-history))
    :hook (completion-list-mode . consult-preview-at-point-mode)
    :init
    (setq xref-show-xrefs-function #'consult-xref
  	xref-show-definitions-function #'consult-xref)
    :config
    (consult-customize consult-buffer
  		     :preview-key "M-.")
    (setq consult-narrow-key ">"))

  (use-package corfu
    :straight (corfu :type git :host github :repo "minad/corfu" :commit "24dccafeea114b1aec7118f2a8405b46aa0051e0")
    :custom
    (corfu-cycle t)
    (corfu-auto t)
    :config
    (global-corfu-mode)
    (corfu-popupinfo-mode))

  (provide 'mg-emacs-buffers-completion)
#+end_src

** The ~mg-emacs-files.el~ module

This module deals with file management. It includes packages to list, manage and open files (and some specific file types).

The ~dired~ file manager is likely one of the most useful and game changing features provided by the Emacs editor. Files, through their listing - e.g., as output of the ~ls~ command -, are managed as they were written into a standard Emacs buffer. This means that every buffer convention still suffices when managing files. I usually omit dot files when listing with ~dired~ (when needed I can always make them appear again by disabling ~dired-omit-mode~).

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-files.el"
  (use-package dired
    :ensure nil
    :custom
    (ls-lisp-use-insert-directory-program nil)
    (ls-lisp-dirs-first t)
    (default-directory "~/"))

  (use-package dired-x
    :ensure nil
    :custom
    (dired-omit-files "^\\...+$")
    (dired-dwim-target t)
    (delete-by-moving-to-trash t)
    (dired-omit-files "^\\.[^.].+$")
    :init
    (add-hook 'dired-mode-hook (lambda () (dired-omit-mode 1))))
#+end_src

There are cases when I need to open a file with an external program (e.g., video files with ~mpv~). For this use-case, there is a useful package called ~openwith~ that let us associate file extensions with external programs to open them.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-files.el"
  (use-package openwith
    :straight t
    :config
    (setq openwith-associations '(
  				("\\.mp4\\'" "mpv" (file))
  				("\\.webm\\'" "mpv" (file))
  				("\\.mkv\\'" "mpv" (file))
  				("\\.m4a\\'" "mpv --force-window" (file))
  				("\\.mov\\'" "mpv" (file))
  				("\\.ppt\\'" "libreoffice" (file))
  				("\\.pptx\\'" "libreoffice" (file))
  				("\\.doc\\'" "libreoffice" (file))
  				("\\.docx\\'" "libreoffice" (file))
  				))
    (openwith-mode t))
#+end_src

When dealing with PDFs, I leverage upon the ~pdf-tools~ suite, which does a pretty good job when it comes to view and annotate PDFs. There are better PDFs viewers out there (some of them have features that could really benefit my use-cases - e.g., [[https://sioyek.info/][Sioyek]]), but my strict requirement is to have one that lies into Emacs and is perfectly integrated with other Emacs packages (e.g., ~org-mode~, ~denote~, ~citar-denote~). That's why I'm using it.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-files.el"
  (use-package pdf-tools
    :straight t
    :config
    (add-hook 'pdf-view-mode-hook #'pdf-links-minor-mode)
    (define-key pdf-view-mode-map (kbd "f") #'pdf-links-isearch-link)
    (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-tools-install))
    (add-hook 'pdf-view-mode-hook
  	    (lambda () (setq header-line-format nil))))

  (provide 'mg-emacs-files)
#+end_src

** The ~mg-emacs-buffers.el~ module

This module handles various buffer editing packages. The concept of buffer is key in Emacs, it is like a sheet of paper in a notebook. Therefore, having packages that, for instance, allow us to move faster in a buffer, or efficiently undo a recent change, I think is of a great value.

The ~vundo~ package is my way to go when it comes to undo changes. I was using ~undo-tree~ before, and I still think it is a valid alternative to what I'm using now. However, I really enjoy ~vundo~'s simplicity and low visual overhead. However, on [2024-10-29 Tue 15:51] I decided to go back to ~undo-tree~ because ~vundo~ is buggy: sometimes I get weird errors when going substantially back in time with the changes, and I also got some ~"No possible route"~ bugs several times.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-buffers.el"
  (use-package undo-tree
    :straight t
    :init
    (global-undo-tree-mode)
    :custom
    (undo-tree-auto-save-history nil))
#+end_src

The ~mg-emacs-buffers~ module also introduces the [[https://github.com/migliio/buffier][buffier]] package, which is a project I created and maintain since [2025-01-11 Sat]. This package provides a streamlined way to open mode-rich temporary buffers and then search and open them. For now, the package is not available on MELPA.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-buffers.el"
  (use-package buffier
    :straight (buffier :type git :host github :repo "migliio/buffier" :branch "master")
    :bind (("C-c u b w" . buffier-new-buffer)
  	 ("C-c u b l" . buffier-buffers)))
#+end_src

My typing skills improved consistently in these years of Emacs usage. Thus, I needed a way to also move the cursor faster in the buffers. That's why I started using ~avy~, whose functionality could be a bit cumbersome at first, but after one gets used to it, is a 10x improvement in speed.
I find convenient to use the ~C-c ;~ and ~C-c ,~ keybindings (they are easily accessible), but they are reserved to ~org~. Hence, ~avy~ is loaded after ~org~ and the two keybindings are first removed from the ~org-mode~ keymap, and then reassigned to the main ~avy~ commands.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-buffers.el"
  (use-package avy
    :straight t
    :after org
    :init
    (eval-after-load 'org
      (progn
        (define-key org-mode-map (kbd "C-c ,") nil)
        (define-key org-mode-map (kbd "C-c ;") nil)))
    :bind
    (("C-c ;" . avy-goto-line)
     ("C-c ," . avy-goto-char)))

  (provide 'mg-emacs-buffers)
#+end_src

** The ~mg-emacs-markup.el~ module

This module loads some packages to handle markup languages as ~outline~ (which is Emacs specific) and Markdown. Although I do not use it extensively, I find ~outline-mode~ pretty useful to divide Emacs Lisp code into outlines (through comments starting with ~;;;~) to easily navigate throughout the file. I use Markdown to mainly write stuff to be later sent as Slack messages: I open a temporary buffer, toggle ~markdown-mode~, write the text with formatting and copy-paste it into Slack.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-markup.el"
  (use-package outline
    :ensure nil
    :bind
    ("C-c u c o" . outline-minor-mode)
    :custom
    (outline-minor-mode-highlight nil)
    (outline-minor-mode-cycle t)
    (outline-minor-mode-use-buttons nil)
    (outline-minor-mode-use-margins nil))

  (use-package markdown-mode
    :straight t
    :mode ("README\\.md\\'" . gfm-mode)
    :init (setq markdown-command "multimarkdown"))

  (provide 'mg-emacs-markup)
#+end_src

