mg-emacs.org
** The ~mg-emacs-denote.el~ module
:PROPERTIES:
:ID:       64ce0bed-fefc-4603-91ef-24b4fd102795
:END:

The second fundamental package that I use for (networked) note-taking is ~denote~. As stated in its README, at its core, it is just an efficient file naming scheme. Clearly, the author built plenty of features on top of this core concept. The package is clean, it reuses a lot of already well-established Emacs features (e.g., ~xref~), and is *extremely* well documented. Moreover, ~denote~ is regularly updated and maintained, so I use the git repository directly with ~straight.el~ to get the bleeding-edge features of it. Shout-out to Prot, who's really the diamond tip of the Emacs community nowadays. I extend ~denote~ on a regular basis, so there is also a custom library I created that is full of features (see [[id:cf17aa34-cd6c-4eea-be80-c111b00f5f3e][The ~mg-denote.el~ library]]).

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-denote.el"
  (use-package denote
    :straight t
    :bind (("C-c n n" . denote)
  	 ("C-c n x" . denote-region)
  	 ("C-c n N" . denote-type)
  	 ("C-c n d" . denote-date)
  	 ("C-c n y f" . denote-org-extras-dblock-insert-files)
  	 ("C-c n y l" . denote-org-extras-dblock-insert-links)
  	 ("C-c n y b" . denote-org-extras-dblock-insert-backlinks)
  	 ("C-c n y h" . denote-org-extras-link-to-heading)
  	 ("C-c n s" . denote-sort-dired)
  	 ("C-c n e n" . denote-silo-extras-create-note)
  	 ("C-c n e f" . denote-silo-extras-open-or-create)
  	 ("C-c n t" . denote-template)
  	 ("C-c n i" . denote-link)
  	 ("C-c n I" . denote-add-links)
  	 ("C-c n b" . denote-backlinks)
  	 ("C-c n j n" . denote-journal-extras-new-entry)
  	 ("C-c n j l" . denote-journal-extras-link-or-create-entry)
  	 ("C-c n j j" . denote-journal-extras-new-or-existing-entry)
  	 ("C-c n h" . denote-org-extras-backlinks-for-heading)
  	 ("C-c n g f" . denote-find-link)
  	 ("C-c n g b" . denote-find-backlink)
  	 ("C-c n y s s" . denote-sequence)
  	 ("C-c n y s r" . denote-sequence-reparent)
  	 ("C-c n y s d" . denote-sequence-dired)
  	 ("C-c n y s f" . denote-sequence-find)
  	 ("C-c n y s l" . denote-sequence-link)
  	 ("C-c n y s c s" . denote-sequence-new-sibling-of-current)
  	 ("C-c n y s c c" . denote-sequence-new-child-of-current)
  	 ("C-c n r" . denote-rename-file)
  	 ("C-c n R" . denote-rename-file-using-front-matter))
    :init
    (add-hook 'dired-mode-hook #'denote-dired-mode-in-directories)
    :custom
    (denote-known-keywords '("emacs" "security" "kernel" "mathematics" "algorithms"))
    (denote-infer-keywords t)
    (denote-sort-keywords t)
    (denote-file-type nil)
    (denote-prompts '(title keywords file-type template signature))
    (denote-excluded-directories-regexp nil)
    (denote-excluded-keywords-regexp nil)
    (denote-date-prompt-use-org-read-date t)
    (denote-date-format nil)
    (denote-rename-buffer-format "[D] %s %t (%k)")
    (denote-backlinks-show-context t)
    (denote-dired-directories
     (list denote-directory
  	 (thread-last denote-directory (expand-file-name "assets"))))
    (add-hook 'dired-mode-hook #'denote-dired-mode-in-directories)
    (denote-templates
     '((plain . "")
       (course . "#+include: \"~/.emacs.d/headers/header_notes_document_small.org\"\n* Course details\n- Lecturer ::\n- University ::\n- Academic year ::\n- Resources ::\n- Description ::\n* Lecture notes\n")
       (zettel . "#+references: \n\n\n-----\n")
       (place . "* Details\n- Link ::\n- Visited ::\n- Description ::\n* Notes\n")
       (contact . "* Contact details\n- E-mail ::\n- Company ::\n- Phone number ::\n- Website ::\n- Twitter ::\n- Additional information ::\n* Notes")))
    (denote-date-prompt-use-org-read-date t)
    (denote-sequence-scheme 'alphanumeric)
    :config
    (denote-rename-buffer-mode 0)
    ;; Due to an org-mode bug, some ~dblock~ functions are not loaded automatically
    (require 'denote-org-extras)
    (require 'denote-sequence))

  (use-package mg-denote
    :ensure nil
    :bind
    (("C-c n f f" . mg-denote-find-file)
     ("C-c n z f" . mg-denote-find-zettel)
     ("C-c n z g" . mg-denote-grep-on-zettels)
     ("C-c n y s i" . mg-denote-get-index-in-dired)
     ("C-c n u" . mg-denote-copy-timestamp-to-killring)
     ("C-c n o r" . mg-denote-copy-to-assets-and-rename)
     ("C-c n z i" . mg-denote-insert-zettel-link)))

  (use-package denote-search
    :straight (denote-search :type git :host github :repo "lmq-10/denote-search" :branch "main")
    :bind
    (("C-c n f s" . denote-search)))

  (use-package denote-explore
    :straight t
    :custom
    (denote-explore-network-directory (concat denote-directory "/.graphs"))
    (denote-explore-network-filename "denote-network")
    (denote-explore-network-format 'gexf)
    (denote-explore-network-graphviz-filetype "gexf"))

  (use-package denote-menu
    :straight t
    :config
    :bind (("C-c n m l" . list-denotes)
  	 ("C-c n m f" . denote-menu-filter-by-keyword)))

  (use-package consult-denote
    :straight t
    :bind (("C-c n f g" . consult-denote-grep)
  	 ("C-c n f c" . consult-denote-find)))

  (provide 'mg-emacs-denote)
#+end_src

** The ~mg-emacs-bib.el~ module
:PROPERTIES:
:ID:       39930734-961e-4da9-9df4-a9e7e4223e2b
:END:

This module introduces several packages that I use to manage bibliographic entries and references in general. In my research work, is super important to have a tidied, smooth and efficient way of managing these things. I use ~citar~ as the main bibliography manager, and the I use ~citar-denote~ and ~citar-embark~ on top of it. The former is actually extremely convenient for people like me using ~denote~ (see [[id:64ce0bed-fefc-4603-91ef-24b4fd102795][The ~mg-emacs-denote.el~ module]]) as their note-taking tool of choice: it allows to link reference notes to bibliography entries, and have a convenient way to search notes and open associated artifacts (e.g., PDF files or web pages).

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-bib.el"
  (use-package citar
    :straight t
    :custom
    (org-cite-insert-processor 'citar)
    (org-cite-follow-processor 'citar)
    (org-cite-activate-processor 'citar)
    (citar-templates
     '((main . "${author editor:30}     ${date year issued:4}     ${title:48}")
       (suffix . "          ${=key= id:15}    ${=type=:12}")
       (preview . "${author editor} (${year issued date}) ${title}, ${journal journaltitle publisher}.\n")
       (note . "@${author editor}, ${title}")))
    (citar-symbol-separator "  ")
    :bind
    (("C-c n c o" . citar-open)
     ("C-c n c b" . citar-open-entry)
     (:map org-mode-map :package org ("C-c b" . #'org-cite-insert)))
    :config
    (setq citar-bibliography (list mg-bibliography-path)))

  (use-package citar-denote
    :straight t
    :custom
    (citar-open-always-create-notes nil)
    (citar-denote-file-type 'org)
    (citar-denote-subdir nil)
    (citar-denote-keyword "bib")
    (citar-denote-use-bib-keywords nil)
    (citar-denote-title-format "title")
    (citar-denote-title-format-authors 1)
    (citar-denote-title-format-andstr "and")
    (citar-denote-template "- Research question ::\n- Sketch solution ::\n")
    :init
    (citar-denote-mode)
    :bind (("C-c n c c" . citar-create-note)
	 ("C-c n c n" . citar-denote-open-note)
	 ("C-c n c d" . citar-denote-dwim)
	 ("C-c n c e" . citar-denote-open-reference-entry)
	 ("C-c n c a" . citar-denote-add-citekey)
	 ("C-c n c k" . citar-denote-remove-citekey)
	 ("C-c n c r" . citar-denote-find-reference)
	 ("C-c n c f" . citar-denote-find-citation)
	 ("C-c n c l" . citar-denote-link-reference)))

  (use-package biblio
    :straight t
    :bind (("C-c p b b" . biblio-lookup)))

  (use-package mg-bib
    :ensure nil
    :after (org)
    :bind (("C-c p b r" . mg-bib-search-add-to-reading-list)
	 ("C-c p b c" . mg-bib-count-references)
	 ("C-c p b n" . mg-bib-denote-goto-notes-interactively)
	 ("C-c p b i" . mg-bib-kill-bibtex-from-isbn)))

  (use-package mg-personal
    :ensure nil)

  (provide 'mg-emacs-bib)
#+end_src

** The ~mg-emacs-ledger.el~ module
:PROPERTIES:
:ID:       5fb29d20-1803-4301-80ff-d05d53397166
:END:

I use the ~hledger~ CLI tool to track my finances. I tried both ~ledger~ and ~hledger~, and I find the latter more sophisticated and feature-rich. The documentation is also significantly better, which played a huge role in picking between the two. They belong to the plain-text and double-entry type of accounting software, widely used and proved to reduce inconsistencies and errors (see also [[https://hledger.org/accounting.html]]). I do the whole finance tracking with an ~org-mode~ file and ~babel~ to then export is as a ~ledger~ journal. In this way, I can later parse it with ~hledger~ and run queries on it.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-ledger.el"
  (use-package ledger-mode
    :straight t
    :init
    (defconst mg-ledger-bin "/usr/bin/hledger")
    :mode ("\\.journal\\'" "\\.ledger\\'" "\\.hledger\\'")
    :custom
    (ledger-binary-path mg-ledger-bin)
    (ledger-mode-should-check-version nil)
    (ledger-report-auto-width nil)
    (ledger-report-use-native-highlighting nil))

  (provide 'mg-emacs-ledger)
#+end_src

