mg-emacs.org
** The ~mg-emacs-flashcards.el~ module
:PROPERTIES:
:ID:       93af5e84-4396-4994-9804-3edc69d8a070
:END:

Spaced repetition is perhaps the only scientific approach to the learning process that has been discovered in the last years. Its effects are tangible and widely studied (see [[https://gwern.net/spaced-repetition]]). To this end, I use a connection between org-mode and [[https://apps.ankiweb.net/][Anki]] to conveniently write and review cards. I have used other org-centered alternatives (e.g., [[https://github.com/l3kn/org-fc][org-fc]] and [[https://orgmode.org/worg/org-contrib/org-drill.html][org-drill]]), but I think reviewing cards also /"on-the-go"/ through a mobile up is a potential speedup in the learning process. I take the use of Anki instead of org-centered alternatives as a test: in case it doesn't provide measurable benefits, I'll go back.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-flashcards.el"
  (use-package anki-editor
    :straight (:type git :host github :repo "anki-editor/anki-editor" :branch "master")
    :bind
    (("C-c o a i" . anki-editor-insert-note)
     ("C-c o a p" . anki-editor-push-notes)))

  (provide 'mg-emacs-flashcards)
#+end_src

** The ~mg-emacs-notmuch.el~ module

I started using ~notmuch~ not so long ago. During a conversation with [[https://protesilaos.com/][Protesilaos Stavrou]], I realized that ~notmuch~ was far better than ~mu4e~, given the specific use cases and needs I had. Therefore, after ~ 2 years of me using ~mu4e~, I gave ~notmuch~ a try. Most of the configuration is done outside Emacs, by tweaking tools as ~msmtp~ and ~mbsync~, and ~notmuch~ itself, which is basically a CLI e-mail indexer. The following piece of code tweaks a couple of important options, and then it is mainly cosmetics.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-notmuch.el"
  (use-package notmuch
    :straight t
    :bind (
  	 :map global-map
  	 ("C-x m" . nil)
  	 ("C-x m o" . notmuch)
  	 :map notmuch-search-mode-map
  	 ("a" . nil)
  	 ("A" . nil)
  	 ("/" . notmuch-search-filter)
  	 ("r" . notmuch-search-reply-to-thread)
  	 ("R" . notmuch-search-reply-to-thread-sender)
  	 :map notmuch-show-mode-map
  	 ("a" . nil)
  	 ("A" . nil)
  	 ("r" . notmuch-show-reply)
  	 ("R" . notmuch-show-reply-sender))
    :custom
    (notmuch-show-logo nil)
    (notmuch-search-oldest-first nil)
    (notmuch-archive-tags nil
  			notmuch-message-replied-tags '("+replied")
  			notmuch-message-forwarded-tags '("+forwarded")
  			notmuch-show-mark-read-tags '("-unread")
  			notmuch-draft-tags '("+draft")
  			notmuch-draft-folder "drafts"
  			notmuch-draft-save-plaintext 'ask)
    (notmuch-show-relative-dates t)
    (notmuch-show-all-multipart/alternative-parts nil)
    (notmuch-show-indent-messages-width 0)
    (notmuch-show-indent-multipart nil)
    (notmuch-show-part-button-default-action 'notmuch-show-view-part)
    (notmuch-show-text/html-blocked-images ".") ; block everything
    (notmuch-wash-wrap-lines-length 120)
    (notmuch-unthreaded-show-out nil)
    (notmuch-message-headers '("To" "Cc" "Subject" "Date"))
    (notmuch-message-headers-visible t)
    :config
    (add-to-list 'notmuch-saved-searches '(:name "mm" :query "tag:mm" :key "m"))
    (defun pop-from-message-completion()
      (pop message--old-style-completion-functions))
    (advice-add 'message-completion-function :after #'pop-from-message-completion)
    (let ((count most-positive-fixnum))
      (setq notmuch-wash-citation-lines-prefix count
  	  notmuch-wash-citation-lines-suffix count)))

  (use-package ol-notmuch
    :straight (ol-notmuch :type git :host github :repo "tarsius/ol-notmuch")
    :after notmuch)

  (use-package mg-notmuch
    :ensure nil
    :after notmuch
    :bind (("C-x m u" . mg-notmuch-update-mail))
    :config

    (setq notmuch-hello-refresh-hook #'mg-notmuch-update-mail))

  (provide 'mg-emacs-notmuch)
  ;;; mg-emacs-notmuch.el ends here
#+end_src

** The ~mg-emacs-languages.el~ module

This module handles all language-specific options, either for markup ones or for programming. It is therefore full of stuff, so maybe in the future it would be better to divide it into smaller sub-modules.

I very rarely use Markdown, mostly when formatting text to send it later on Slack or related software. The workflow I've been having (that should change sooner or later) is to just open a temporary buffer, turn ~markdown-mode~ on, write the formatted message, and then send it on Slack. I'd rather go with an automated feature that enables all of that automatically without the need to do everything by hand (e.g., press a keystroke, and choose the mode interactively, and just spawn the buffer with that mode).

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-languages.el"
  (use-package markdown-mode
    :straight t
    :mode ("README\\.md\\'" . gfm-mode)
    :init (setq markdown-command "multimarkdown"))
#+end_src

Since natural language is still a language, let's enable spellchecking in this module.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-languages.el"
  (dolist (hook '(text-mode-hook))
    (add-hook hook (lambda () (flyspell-mode 1))))
#+end_src

Since I work with the Linux kernel every single day, I want Emacs to format C code as stated by the kernel community's directives. The code below sets the C style to be compliant to those directives.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-languages.el"
  (setq c-default-style "linux")
#+end_src

The following is a series of packages to enable LSP and major-modes for some programming languages. I've been using ~eglot~ as LSP client for quite a while now, and I'd say that I'm really satisfied with it. The code below is basically a setup of some configuration options for ~eglot~ (already shipped with Emacs 29) and the declarations for some programming modes. I used ~lsp-mode~ in the past, but I think ~eglot~ has the perfect balance between simplicity and feature-richness.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-languages.el"
  (use-package dockerfile-mode
    :straight t
    :mode "\\.docker.file\\'" "\\Dockerfile\\'")

  (use-package haskell-mode
    :straight t
    :mode "\\.hs\\'")

  (use-package bpftrace-mode
    :straight t
    :mode "\\.bt\\'")

  (use-package racket-mode
    :straight t
    :mode "\\.rkt\\'")

  (use-package python-mode
    :straight t
    :mode "\\.py\\'")

  (use-package edts
    :straight t)

  (use-package erlang-mode
    :ensure nil
    :after (edts)
    :mode "\\.erl\\'")

  (use-package gnuplot
    :straight t)

  (use-package fasm-mode
    :straight t)

  (use-package pyvenv
    :straight t)

  (provide 'mg-emacs-languages)
#+end_src

** The ~mg-emacs-browsing.el~ module

In this module, I enable some of the packages I use for browsing the web. The preferred way to do so is clearly a full-fledged web browser, but I often type queries directly in Emacs using ~engine-mode~. For fast searches and plain HTML websites, ~eww~ is a convenient Emacs-based alternative to a standard web browser.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-browsing.el"
  (use-package engine-mode
    :straight t
    :config
    (engine/set-keymap-prefix (kbd "C-c u e"))
    (defun mg-engine-mode-exact-phrase-transform (search-term)
      (if current-prefix-arg
  	(concat "\"" search-term "\"")
        search-term))
    (defengine archwiki
      "https://wiki.archlinux.org/index.php?search=%s"
      :keybinding "a")
    (defengine google
      "http://www.google.com/search?hl=en&ie=utf-8&oe=utf-8&q=%s"
      :keybinding "g"
      :term-transformation-hook mg-engine-mode-exact-phrase-transform)
    (defengine elixir
      "https://elixir.bootlin.com/linux/latest/A/ident/%s"
      :keybinding "k")
    (defengine kernel-documentation
      "https://www.kernel.org/doc/html/v4.12/core-api/kernel-api.html#c.%s"
      :keybinding "d")
    (defengine syscall-table
      "https://syscalls.mebeim.net/?table=x86/64/x64/latest"
      :keybinding "s")
    (defengine google-maps
      "https://www.google.com/maps/search/%s/"
      :keybinding "M")
    (defengine semantic-scholar
      "https://www.semanticscholar.org/search?q=%s&sort=relevance"
      :keybinding "r")
    (defengine openstreetmap
      "https://www.openstreetmap.org/search?query=%s"
      :keybinding "m")
    (defengine wordreference-iten
      "https://www.wordreference.com/iten/%s"
      :keybinding "i")
    (defengine wordreference-enit
      "https://www.wordreference.com/enit/%s"
      :keybinding "e")
    (defengine wikipedia
      "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
      :keybinding "w")
    (defengine youtube
      "http://www.youtube.com/results?aq=f&oq=&search_query=%s"
      :keybinding "y")
    (engine-mode t))

  (use-package eww
    :ensure nil
    :config
    (setq shr-use-fonts nil)
    (setq shr-color-visible-luminance-min 80)
    (setq shr-use-colors nil))

  (provide 'mg-emacs-browsing)
#+end_src

** The ~mg-emacs-git.el~ module

I use ~magit~ as git client for Emacs. I think it is, along with ~org-mode~, the most impactful Emacs package I have ever used. There is nothing more to add. Besides ~magit~, I used ~git-email~, which is a simple package that allows to send e-mails with git patches directly in Emacs. Starting from Emacs 29, they introduced ~vc-prepare-patch~ natively, which basically covers the same features of ~git-email~ (see [[https://lists.sr.ht/~yoctocell/git-email-devel/%3Ccc4a1b8b-9a1d-46cf-9b04-466c85ebcd44%40riseup.net%3E]]). There is not much to configure in ~magit~, just some formatting configurations just for being compliant to the Linux kernel's coding (and patching) guidelines.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-git.el"
  (use-package magit
    :straight t
    :bind (("C-c x" . magit))
    :config
    (setf (alist-get 'unpushed magit-section-initial-visibility-alist) 'show)
    (setq magit-refresh-status-buffer t)
    (setq git-commit-fill-column 75))

  (provide 'mg-emacs-git)
#+end_src

