mg-emacs.org
** The ~mg-emacs-programming.el~ module
:PROPERTIES:
:ID:       603EA351-F695-447C-A2EB-AD7FB7C61E5E
:END:

In this module, I pull and enable several coding-related packages, regardless of their specific functionality: they could either allow to inspect code, execute diffs, move cursors around. I don't know whether I should further sub-categorize them, but for now it's better to stick with this solution. Some of these packages are crucial for my work with the Linux kernel (e.g., ~xcscope~, ~multiple-cursors~), and I use them extensively, while I use others very rarely (e.g., ~ztree~).

Having multiple cursors is a neat feature that changed the way I look and modify source code. I started to realize how many times we have common patterns that we repeatedly modify, wasting time and energy. Whenever you realize this fact, having multiple cursors and edit different parts of the text at the same time is a valuable feature that could hardly be ignored. The ~multiple-cursor~ package does the job wonderfully.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-programming.el"
  (use-package multiple-cursors
    :after (org)
    :straight t
    :bind (("C-c m >" . #'mc/mark-next-like-this)
  	 ("C-c m <" . #'mc/mark-previous-like-this)
  	 ("C-c m -" . #'mc/mark-next-like-this-word)
  	 ("C-c m e" . 'mc/mark-more-like-this-extended)
  	 ("C-c m s" . 'mc/mark-all-dwim)
  	 ("C-c m a" . mc/mark-all-like-this)
  	 ("C-c m r" . mc/mark-all-in-region)
  	 ("C-c m d" . mc/mark-all-like-this-dwim)
  	 ("C-c m w" . mc/mark-all-words-like-this))
    :custom
    (mc/always-run-for-all t)
    :init
    (require 'multiple-cursors)
    (define-key mc/keymap (kbd "<return>") nil)
    :config
    (multiple-cursors-mode 1))
#+end_src

The following packages, instead, are mostly for source code analysis and browsing. For sure, ~xcscope~ is the killer package here, and I use it every day multiple times. When it comes to inspecting *huge* codebases (e.g., the Linux kernel), having an efficient way to find definitions, function calling another function, patterns, etc. is fundamental. The ~xcscope~ package is just a ~cscope~ client for Emacs (to make ~cscope~ to work you typically have to build a ~cscope~ "database" - e.g., in the Linux kernel you simply type ~make cscope~).

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-programming.el"
  (use-package deadgrep
    :straight t
    :bind
    (("M-g r" . deadgrep)))

  (use-package xcscope
    :straight t
    :bind
    (("C-c s s" . cscope-find-this-symbol)
     ("C-c s d" . cscope-find-global-definition)
     ("C-c s c" . cscope-find-functions-calling-this-function)
     ("C-c s x" . cscope-set-initial-directory)
     ("C-c s f" . cscope-find-this-file))
    :config
    (cscope-setup))

  (use-package ediff
    :straight t
    :config
    (set 'ediff-window-setup-function 'ediff-setup-windows-plain))
#+end_src

Although I do not use it just for coding (but for templates in general, even in org files), ~yasnippet~ is another great tool that I leverage upon.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-programming.el"
  (use-package yasnippet
    :straight t
    :init
    (defconst mg-snippets-dir ".snippets")
    :custom
    (yas-snippet-dirs (list (format "%s/%s" mg-emacs-root mg-snippets-dir)))
    :config
    (yas-global-mode 1))
#+end_src

I mostly write and review code for the [[https://kernel.org/][Linux kernel]]. I have a custom library with some useful functions I use on my daily work. They are not ground-breaking, rather they just speed-up some repeated operations.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-programming.el"
  (use-package mg-kernel
    :ensure nil
    :after (cc-mode)
    :bind
    (:map c-mode-map
  	("C-c v" . mg-get-kernel-version-from-source)
  	("C-c ." . mg-kernel-do-grep)))
#+end_src

The following piece of code introduces ~vterm~ as terminal emulator, with ~multi-vterm~ on top of it. I've been using ~vterm~ since the very beginning, and never felt the need to switch to any other terminal emulator (e.g., ~eshell~). The ~multi-vterm~ package, instead, allows to spawn multiple ~vterm~ buffer, that in conjunction with window splitting and multiple buffer basically creates a "terminal multiplexer" inside of Emacs.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-programming.el"
  (when (display-graphic-p)
    (progn
      (use-package vterm
        :straight t)
      (use-package multi-vterm
        :straight t
        :bind (("C-c v" . multi-vterm)))))

  (provide 'mg-emacs-programming)
#+end_src

** The ~mg-emacs-ai.el~ module

Starting from [2024-10-15 Tue], I plan to use open-source LLMs to help in my research work. This includes summarizing text, spell-checking and rephrasing. Although some skepticism, I found that these tools can substantially help us with some tasks related to the writing process, either it is for research or note-taking. As far as Emacs is concerned, these tools can be deeply integrated in one's workflow and generally provide a smooth experience without the pain of using webapps or other bloated nonsense.

#+begin_src emacs-lisp :tangle "mg-emacs-modules/mg-emacs-ai.el"
  (use-package ellama
    :straight t
    :custom
    (ellama-keymap-prefix "C-c u a")
    (ellama-language "English")
    :config
    (require 'llm-ollama)
    (if (eq system-type 'darwin)
        (setq ellama-provider
  	    (make-llm-ollama
  	     :chat-model "llama3.3:70b"))
      (setq ellama-provider
  	  (make-llm-ollama
  	   :chat-model "llama3.2:latest"))))

  (provide 'mg-emacs-ai)
#+end_src

* The ~mg-custom-modules~ libraries
