mg-emacs.org
** The ~mg-defaults-extensions.el~ library

#+begin_src emacs-lisp :tangle "mg-custom-modules/mg-defaults-extensions.el"
  ;;; mg-emacs-default-extensions.el --- Sane extensions to the defaults for Emacs  -*- lexical-binding: t -*-

  ;; Copyright (C) 2024  Claudio Migliorelli

  ;; Author: Claudio Migliorelli <claudio.migliorelli@mail.polimi.it>
  ;; URL: https://crawlingaway.org/emacs/dot-emacs
  ;; Version: 0.0.1
  ;; Package-Requires: ((emacs "29.3"))

  ;; This file is NOT part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:
  ;; This source file introduces some extensions (e.g., minor/major
  ;; modes) to the ones I usually enable when using Emacs.

  ;;; Code:
  (define-minor-mode mg-line-numbers-highlight-line-mode
    "This minor mode shows line numbers in relative mode and
  highlights the current line. I use it extensively when in coding."
    :initial nil
    (if mg-line-numbers-highlight-line-mode
        (progn
  	(display-line-numbers-mode 1)
  	(hl-line-mode 1)
  	(setq display-line-numbers-type 'relative))
      (progn
        (display-line-numbers-mode 0)
        (hl-line-mode 0))))

  (provide 'mg-defaults-extensions)
  ;;; mg-defaults-extensions.el ends here
#+end_src

** The ~mg-modeline.el~ library

#+begin_src emacs-lisp :tangle "mg-custom-modules/mg-modeline.el"
  ;;; mg-modeline.el --- Custom modeline for the Emacs editor -*- lexical-binding: t -*-

  ;; Copyright (C) 2024  Claudio Migliorelli

  ;; Author: Claudio Migliorelli <claudio.migliorelli@mail.polimi.it>
  ;; URL: https://crawlingaway.org/emacs/dot-emacs
  ;; Version: 0.0.1
  ;; Package-Requires: ((emacs "29.4"))

  ;; This file is NOT part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:
  ;; This source file defines a custom modeline for the Emacs editor. It
  ;; has a cleaner structure compared to the original one, and
  ;; highlights buffer state (i.e., local vs. remote, saved vs. unsaved)
  ;; more clearly.

  ;;; Code:

  (defvar mg-modeline-buffer-status
    '(:eval
      (if (file-remote-p default-directory)
  	(propertize " @ "
  		    'mouse-face 'mode-line-highlight)
        (propertize " ^ "
  		  'mouse-face 'mode-line-highlight)))
    "This is the propertized variable containing the status of the
  current buffer. The status specifies whether this buffer is
  remote or local.")

  (defvar mg-modeline-buffer-name
    '(:eval
      (propertize (buffer-name) 'face 'mode-line-buffer-id))
    "This is the propertized variable containing the current buffer's
  name.")

  (defun mg-modeline--major-mode ()
    "Get the current major mode for the opened buffer. The major mode
  is obtained by looking at the `major-mode' variable. In case we
  are under EXWM, the major mode haas also a `exwm--input-mode'
  further specification (i.e., Char or Line) that is also useful to
  specify in the modeline."
    (let* ((mode
  	  (mapconcat 'capitalize
  		     (butlast (split-string (symbol-name major-mode) "-")) " "))
  	 (mode-final
  	  (if (string-equal mode "Exwm")
  	      (concat "Exwm: "
  		      (mapconcat 'capitalize
  				 (butlast (split-string (symbol-name exwm--input-mode) "-"))))
  	    mode))
  	 (indicator (cond
  		     ((derived-mode-p 'text-mode) "§")
  		     ((derived-mode-p 'prog-mode) "λ")
  		     ((derived-mode-p 'comint-mode) ">_")
  		     (t "o"))))
      (format "%s (%s)" indicator mode-final)))

  (defvar mg-modeline-major-mode
    '(:eval
      (mg-modeline--major-mode))
    "This is the variable containing the major mode for the current
   buffer, as returned by the `mg-modeline--major-mode' function")

  (defvar mg-modeline-buffer-mode
    '(:eval
      (if buffer-read-only
  	"*L*"
        "*U*"))
    "This is the variable indicating whether the buffer is in
   read-only mode or not." )

  (setq-default mode-line-format
  	      '("%e"
  		mg-modeline-buffer-status
  		mg-modeline-buffer-mode
  		" "
  		mg-modeline-buffer-name
  		" "
  		mode-line-position
  		"  "
  		'(:eval (propertize vc-mode 'face 'mode-line-buffer-id))
  		"  "
  		mg-modeline-major-mode
  		"  "
  		'(:eval
  		 (when (mode-line-window-selected-p)
  		   (propertize mode-line-end-spaces 'face '(:foreground "black"))))))

  (dolist (construct
  	 '(mg-modeline-major-mode
  	   mg-modeline-buffer-mode
  	   mg-modeline-buffer-status
  	   mg-modeline-buffer-name))
    (put construct 'risky-local-variable t))

  (provide 'mg-modeline)
  ;;; mg-modeline.el ends here
#+end_src

** The ~mg-macos.el~ library
:PROPERTIES:
:ID:       93f60f28-3019-4010-9012-f7897dc3b873
:END:

#+begin_src emacs-lisp :tangle "mg-custom-modules/mg-macos.el"
  ;;; mg-macos.el --- Enable macos support -*- lexical-binding: t -*-

  ;; Copyright (C) 2024  Claudio Migliorelli

  ;; Author: Claudio Migliorelli <claudio.migliorelli@mail.polimi.it>
  ;; URL: https://crawlingaway.org/emacs/dot-emacs
  ;; Version: 0.0.1
  ;; Package-Requires: ((emacs "29.3"))

  ;; This file is NOT part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.
  ;;
  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.
  ;;
  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

  ;;; Commentary:
  ;; This source file just enables some options to make Emacs smooth on
  ;; `darwin' as well. Nothing more.

  ;;; Code:

  (defun mg-macos-support-enable ()
    "This function simply turns some options on, for me to have a
   smooth experience with Emacs even on `darwin'."
    (progn
      (setenv "LANG" "en_US.UTF-8")
      (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
      (add-to-list 'default-frame-alist '(ns-appearance . dark))
      (setq ns-use-proxy-icon nil
  	  mac-option-modifier 'meta
  	  frame-title-format nil
  	  mac-frame-tabbing nil)
      (menu-bar-mode t)))

  (provide 'mg-macos)
  ;;; mg-macos.el ends here
#+end_src

